create_clock -period 20.000 -name CLOCK_IN -waveform {0.000 10.000} [get_ports CLOCK_IN]
set_input_delay -clock [get_clocks CLOCK_IN] -min -add_delay 7.000 [get_ports RESET]
set_input_delay -clock [get_clocks CLOCK_IN] -max -add_delay 9.000 [get_ports RESET]
set_output_delay -clock [get_clocks CLOCK_IN] -min -add_delay -1.000 [get_ports OUT_HIGH]
set_output_delay -clock [get_clocks CLOCK_IN] -max -add_delay 6.000 [get_ports OUT_HIGH]
set_output_delay -clock [get_clocks CLOCK_IN] -min -add_delay -1.000 [get_ports OUT_LOW]
set_output_delay -clock [get_clocks CLOCK_IN] -max -add_delay 6.000 [get_ports OUT_LOW]

set_property PACKAGE_PIN L1 [get_ports OUT_HIGH]
set_property PACKAGE_PIN N3 [get_ports OUT_LOW]
set_property PACKAGE_PIN U18 [get_ports RESET]
set_property PACKAGE_PIN W5 [get_ports CLOCK_IN]
set_property IOSTANDARD LVCMOS18 [get_ports CLOCK_IN]
set_property IOSTANDARD LVCMOS18 [get_ports OUT_HIGH]
set_property IOSTANDARD LVCMOS18 [get_ports OUT_LOW]
set_property IOSTANDARD LVCMOS18 [get_ports RESET]

set_property IOSTANDARD LVCMOS18 [get_ports NOT_LOW]
set_property PACKAGE_PIN K17 [get_ports NOT_LOW]
